from pyecharts.components import Table
from pyecharts.options import ComponentTitleOpts


table = Table()

headers = ["","1949-1978年  计划经济时代", "1979-1997年 改革开放时代", "1998-2016 中国特色社会主义发展时代"]
rows = [
    ["保障制度", "国家、单位和集体保障", "市场经济冲击下的医疗保障解体", "以基本医疗保险为核心，社会医疗救助为安全网，\n商业医疗保险为补充"],
    ["制度背景", "公有制为主的计划经济体制", "计划经济向社会主义市场经济体制的转型", "中国特色社会主义市场经济"],
    ["医疗保障", "公费医疗制度：向国家工作人员提供免费医疗\n及卫生服务", "医疗机构市场化：医院转向以营利为目的经营管理", "城镇居民基本医疗保险"],
    ["农村保障", "农村合作医疗制度：基于人民公社集体经济的\n农民互助互济制度", "农村医疗合作制度解体", "新型农村合作医疗制度"],
    ["职工保障", "劳保医疗制度：给予丧失劳动能力的劳动者物\n质帮助",
     "职工个人医疗账户：职工与用人单位共同缴纳医疗\n保险存入账户，账户的本金和利息只能用于支付职\n工个人的医疗费用",
     "城镇职工基本医疗保险制度"],
    ["制度优势", "建立了比较完善的城乡医疗卫生服务体系结构", "无", "分别覆盖了城镇就业人口、城镇非就业人口、农村人\n口和城乡困难人群"],
    ["制度缺陷", "由地方性的集体经济作为供给主体，\n在现代医疗服务体系下无法持续",
     "卫生资源总支出不断增加，却最终造成了配置不平\n衡、效率低下的医疗困境",
     "覆盖面与统筹层次过低，医疗保障水平层次不齐"],
]
table.add(headers, rows)
table.set_global_opts(
    title_opts=ComponentTitleOpts(title="中国医疗保障体系建设三阶段", subtitle="数据来源：自行整理"),
)
table.render(r"C:\Users\User\Desktop\2020大三第一学期\数据新闻\可视化-数据图表\医保表格.html")

